<?php

class CErrorCode{
	
	public static $_ERRORCODE = array(
		// bumblebee 
		// "2201"=>"任務基本陣列參數不足 uuid url  exit_node host port user password cookie ",
		// "2202"=>"uuid 空的",
		// "2203"=>"uuid 已經存在",
		// "2204"=>"tor 未啟動",
		// "2205"=>"設定 tor proxy port error",
		// "2206"=>"tor 無法設定跳板",
		// "2207"=>"設定exit_node 跳板不存在",
		// "2208"=>"跳板狀態休眠中",
		// "2209"=>"跳板狀態離線",
		// "2210"=>"跳板狀態不明",
		// "2211"=>"未設定跳板",
		// "2212"=>"跳板未設定 proxy代理必須有",
		// "2213"=>"proxy port 錯誤",
		// "2214"=>"task URL 空的",
		
		// mission放棄重排
		"2101" => "任務完成",
		//"2102" => "任務失敗，找不到腳本",
		"2103" => "線路無法使用",
		"2104" => "絕對路徑無效",
		"2105" => "相對路徑無效",
		"2106" => "由相對路徑取得的絕對路徑無法使用",
		"2107" => "找不到元素",
		"2108" => "送出結果的絕對路徑無效",
		"2109" => "送出結果的相對路徑無效",
		"2110" => "無法設定送出結果","",
		"2111" => "任務失敗，腳本頁面為空",
		"2114" => "送出結果條件判斷送出成功",
		//"2115" => "更換IP成功",
		//"2116" => "任務失敗，腳本頁面比對失敗不是下一頁",
		"2117" => "沒有使用指定線路",        //benjamin
		"2118" => "無法建立WebSocket連線",
		"2120" => "頁面載入逾時",
		"2121" => "任輸入認證碼逾時",
		"2122" => "送出結果檢查逾時",
		"2124" => "執行逾時",
		//"2126" => "任務失敗，無任何步驟",
		"2127" => "點擊失敗",
		"2128" =>"選項選擇錯誤",
		"2129" =>"填入值輸入錯誤",
		"2130" => "未被領取",
		"2131" => "無回報",
		"2132" => "格式不符",
		"2133" => "實際填入值與給予值不同",

		//線路問題
		"2112" => "更換IP失敗",
		"2119" => "更換IP次數超過設定值",
		"2123" => "更換IP逾時",
		"2125" => "無法進入IP檢查頁面",

		//半自動回報的錯誤
		'3001' => '網路連線失效',
		'3002' => '因為網站原因導致任務失敗',
		'3003' => '沒有收到認證信',
		'3004' => '註冊資料重複',
		'3005' => '欄位格式不正確',
		'3006' => "出現手機驗證",
		'2104' => '絕對路徑無效',
		'3000' => '其他',
	);

	
	public static $_semi_automatic_err_code = array(
		'3001' => '網路連線失效',
		'3002' => '因為網站原因導致任務失敗',
		'3003' => '沒有收到認證信',
		'3004' => '註冊資料重複',
		'3005' => '欄位格式不正確',
		'3006' => "出現手機驗證",
		'2104' => '絕對路徑無效',
		'3000' => '其他',
	);
}
?>